#+title: Freenet Project: Leap over Censorship
#+language: en
#+startup: beamer
#+LaTeX_CLASS: beamer
#+LaTeX_CLASS_OPTIONS: [presentation]
#+LATEX_HEADER:\usepackage{beamerthemefreenet}
#+options: H:2 ^:nil
#+COLUMNS: %45ITEM %10BEAMER_env(Env) %10BEAMER_envargs(Env Args) %4BEAMER_col(Col) %8BEAMER_extra(Extra)
#+PROPERTY: BEAMER_col_ALL 0.1 0.2 0.3 0.4 0.5 0.6 0.7 0.8 0.9 0.0 :ETC
#+latex_header: \subtitle[The technical part of the solution for freedom of the press in the internet]{The technical part of the solution for freedom of the press in the internet}

** Routing Simulation

#+BEGIN_SRC python :tangle routingsim.py :exports none :results output
  import math
  import random
  size = 1000
  locs = [random.random() for i in range(size)]
  outdegree = int(math.log(size, 2))
  backoffprobability = 0.0


  def plotlinklengths(nets, title, filepath=None):
    import numpy
    import pylab
    pylab.clf()
    pylab.figure(figsize=(16,9))
    for net in nets:
        lengths = []
        for node in net:
          for link in net[node]:
            lengths.append(min(abs(link - node), abs(link - node - 1), abs(link - node + 1)))
        pylab.plot(sorted(lengths), numpy.arange(len(lengths))/float(len(lengths)), linewidth=4)
    pylab.xscale("log")
    pylab.xlabel("link length")
    pylab.ylabel("fraction of links with this length or less")
    pylab.title(title)
    pylab.xlim(1./(size**2), 0.5)
    if filepath:
      pylab.savefig(filepath)
    else:
      pylab.show()


  def plotring(locs, paths, title, filepath=None):
    import pylab, numpy
    pylab.clf()
    pylab.figure(figsize=(12,9))
    locs = numpy.array(locs)
    ringx = numpy.sin(locs*math.pi*2)
    ringy = numpy.cos(locs*math.pi*2)
    pylab.scatter(ringx, ringy)# , color=matplotlib.cm.spectral(locs))
    for path in paths:
        path = numpy.array(path)
        pathx = numpy.sin(path*math.pi*2)
        pathy = numpy.cos(path*math.pi*2)
        for n,x in enumerate(pathx):
          try:
            xp1 = pathx[n+1]
            y = pathy[n]
            yp1 = pathy[n+1]
            # color = matplotlib.cm.spectral(locs[n])
          except:
            break
          # pylab.plot([x, xp1], [y, yp1])# , color=color)
        pylab.plot(pathx, pathy, linewidth=2)# , color=color)
    pylab.title(title)
    if filepath:
      pylab.savefig(filepath)
    else:
      pylab.show()


  def step(path, node, peers, target):
    # depth first traversal
    p = set(path)
    untested = [peer for peer in list(peers)
                if not peer in p 
                and random.random() > backoffprobability]
    if not untested:
      if not path[:-1]:
         raise ValueError("No nodes to test and cannot step back: Cannot find a route to the target in this network.")
      # step back
      return path[-2]
    best = sorted(untested, key=lambda peer: abs(peer - target))[0]
    if best == node:
      if not path[:-1]:
         raise ValueError("Cannot find a route to the target in this network.")
      best = path[-2]
    return best


  def randomrouting(locs, start, target, filepath=None):
      path = [start]
      randomnet = {}
      for i in locs:
        peers = set()
        for j in range(outdegree):
          peer = random.choice(locs)
          while peer in peers:
              peer = random.choice(locs)
          peers.add(peer)
        randomnet[i] = list(peers)
      # show random net
      links = []
      for i in randomnet:
        links.append(randomnet[i])
      # route on random net
      while path[-1] != target:
        node = path[-1]
        peers = randomnet[node]
        path.append(step(path, node, peers, target))
      return randomnet, path


  def smallworldrouting(locs, start, target, filepath=None):
      path = [start]
      # small world routing
      smallworldnet = {}
      sortedlocs = sorted(list(locs))
      lensortedlocs = len(sortedlocs)
      linksperhop = max(1, outdegree//3)
      for i in sortedlocs:
          smallworldnet[i] = []
      # know your neighbors
      halfnumshortlinks = max(1, linksperhop/2) + 1
      maxshortdistance = outdegree/2
      for dist in range(halfnumshortlinks):
        for n, i in enumerate(sortedlocs):
          down = min([random.choice(range(maxshortdistance)) for trias in range(3)]) + 1
          up = min([random.choice(range(maxshortdistance)) for trias in range(3)]) + 1
          lower = sortedlocs[(n-down)%lensortedlocs]
          while lower in smallworldnet[i]:
              down += 1
              lower = sortedlocs[(n-down)%lensortedlocs]
          upper = sortedlocs[(n+up)%lensortedlocs]
          while upper in smallworldnet[i]:
              up += 1
              upper = sortedlocs[(n+up)%lensortedlocs]
          smallworldnet[i].append(lower)
          smallworldnet[i].append(upper)
      # long connections
      numlonglinks = linksperhop
      for n, i in enumerate(sortedlocs):
        longlinks = set()
        longlink = random.choice(sortedlocs)
        for l in range(numlonglinks):
          while longlink in longlinks:
            longlink = random.choice(sortedlocs)
          longlinks.add(longlink)
        smallworldnet[i].extend(list(longlinks))
      # as many medium size links as left after substracting the long and short links
      nummediumlinks = outdegree - (halfnumshortlinks*2) - numlonglinks
      maxmediumdistance = max(lensortedlocs/(outdegree*2), outdegree)
      for i in range(nummediumlinks):
        for n, i in enumerate(sortedlocs):
          down = random.choice(range(maxmediumdistance)) + 1
          up = random.choice(range(maxmediumdistance)) + 1
          lower = (n-down)%lensortedlocs
          while lower in smallworldnet[i]:
              down += 1
              lower = sortedlocs[(n-down)%lensortedlocs]
          upper = (n+up)%lensortedlocs
          while upper in smallworldnet[i]:
              up += 1
              upper = sortedlocs[(n+up)%lensortedlocs]
          smallworldnet[i].append(sortedlocs[lower])
          smallworldnet[i].append(sortedlocs[upper])
      # show small world net
      links = []
      for i in smallworldnet:
        links.append(smallworldnet[i])
      # route on small world net
      while path[-1] != target:
        node = path[-1]
        peers = smallworldnet[node]
        path.append(step(path, node, peers, target))
      return smallworldnet, path

  def kleinbergrouting(locs, start, target, filepath=None):
      path = [start]
      # small world routing
      smallworldnet = {}
      sortedlocs = sorted(list(locs))
      lensortedlocs = len(sortedlocs)
      linksperhop = max(1, outdegree//3)
      for i in sortedlocs:
          smallworldnet[i] = []
      # know your neighbors
      halfnumshortlinks = max(1, linksperhop)
      maxshortdistance = 1
      for dist in range(halfnumshortlinks):
        for n, i in enumerate(sortedlocs):
          down = min([random.choice(range(maxshortdistance)) for trias in range(3)]) + 1
          up = min([random.choice(range(maxshortdistance)) for trias in range(3)]) + 1
          lower = sortedlocs[(n-down)%lensortedlocs]
          while lower in smallworldnet[i]:
              down += 1
              lower = sortedlocs[(n-down)%lensortedlocs]
          upper = sortedlocs[(n+up)%lensortedlocs]
          while upper in smallworldnet[i]:
              up += 1
              upper = sortedlocs[(n+up)%lensortedlocs]
          smallworldnet[i].append(lower)
          smallworldnet[i].append(upper)
      # long connections
      numlonglinks = max(1, linksperhop/3)
      for n, i in enumerate(sortedlocs):
        longlinks = set()
        longlink = random.choice(sortedlocs)
        for l in range(numlonglinks):
          while longlink in longlinks:
            longlink = random.choice(sortedlocs)
          longlinks.add(longlink)
        smallworldnet[i].extend(list(longlinks))
      # as many medium size links as left after substracting the long and short links
      nummediumlinks = outdegree - (halfnumshortlinks*2) - numlonglinks
      maxmediumdistance = max(lensortedlocs/(outdegree*2), outdegree)
      for i in range(nummediumlinks):
        for n, i in enumerate(sortedlocs):
          down = random.choice(range(maxmediumdistance)) + 1
          up = random.choice(range(maxmediumdistance)) + 1
          lower = (n-down)%lensortedlocs
          while lower in smallworldnet[i]:
              down += 1
              lower = sortedlocs[(n-down)%lensortedlocs]
          upper = (n+up)%lensortedlocs
          while upper in smallworldnet[i]:
              up += 1
              upper = sortedlocs[(n+up)%lensortedlocs]
          smallworldnet[i].append(sortedlocs[lower])
          smallworldnet[i].append(sortedlocs[upper])
      # show small world net
      links = []
      for i in smallworldnet:
        links.append(smallworldnet[i])
      # route on small world net
      while path[-1] != target:
        node = path[-1]
        peers = smallworldnet[node]
        path.append(step(path, node, peers, target))
      return smallworldnet, path

  randompaths = []
  smallworldpaths = []
  kleinbergpaths = []
  randomnets = []
  smallworldnets = []
  kleinbergnets = []
  for i in range(10):
      target = random.choice(locs)
      start = random.choice(locs)
      randomnet, randompath = randomrouting(locs, start, target)
      smallworldnet, smallworldpath = smallworldrouting(locs, start, target)
      kleinbergnet, kleinbergpath = kleinbergrouting(locs, start, target)
      randompaths.append(randompath)
      smallworldpaths.append(smallworldpath)
      kleinbergpaths.append(kleinbergpath)
      randomnets.append(randomnet)
      smallworldnets.append(smallworldnet)
      kleinbergnets.append(kleinbergnet)

  randompathlens = [len(p) for p in randompaths]
  smallworldpathlens = [len(p) for p in smallworldpaths]
  kleinbergpathlens = [len(p) for p in kleinbergpaths]

  print "random:", randompathlens
  print "small world:", smallworldpathlens
  print "Kleinberg:", kleinbergpathlens

  import numpy
  plotlinklengths(randomnets+smallworldnets+kleinbergnets, "Link lengths", 
           filepath="size-{}-peers-{}-backoffpercentage-{:03}-hash-{}-linklengths.png".format(
             len(locs), outdegree, int(100*backoffprobability), hash(tuple(locs))))
  plotring(locs, randompaths, "random paths", 
           filepath="size-{}-peers-{}-backoffpercentage-{:03}-hash-{}-meanlen-{}-random.png".format(
             len(locs), outdegree, int(100*backoffprobability), hash(tuple(locs)), int(numpy.mean(randompathlens))))
  plotring(locs, smallworldpaths, "small world paths", 
           filepath="size-{}-peers-{}-backoffpercentage-{:03}-hash-{}-meanlen-{}-smallworld.png".format(
             len(locs), outdegree, int(100*backoffprobability), hash(tuple(locs)), int(numpy.mean(smallworldpathlens))))
  plotring(locs, kleinbergpaths, "small world paths", 
           filepath="size-{}-peers-{}-backoffpercentage-{:03}-hash-{}-meanlen-{}-kleinberg.png".format(
             len(locs), outdegree, int(100*backoffprobability), hash(tuple(locs)), int(numpy.mean(kleinbergpathlens))))

#+END_SRC

#+RESULTS:
: random: [284, 140, 181, 23, 87, 241, 222, 157, 38, 128]
: small world: [8, 5, 4, 12, 7, 5, 7, 3, 7, 5]
: Kleinberg: [8, 4, 10, 7, 12, 11, 5, 5, 9, 6]


